# Data Visualization
----

In [5]:
# Dependencies

# Pandas
import pandas as pd
import sqlalchemy 
import psycopg2


#MatPlotLib/NumPy/SciPy

%matplotlib inline
from matplotlib import pyplot as plt
import numpy as np
import scipy.stats as stats

# SQL Alchemy
from sqlalchemy import create_engine

#connect to local database
engine = create_engine('postgresql://postgres:postgres@localhost/Employee_SQL')
connection = engine.connect()

In [41]:
engine.table_names()

C:\Users\User\anaconda3\envs\pythondata\lib\site-packages\ipykernel_launcher.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  """Entry point for launching an IPython kernel.

['departments',
 'employees',
 'dept_emp',
 'dept_manager',
 'salaries',
 'title_id']

In [42]:
employees= pd.read_sql('select * from employees', connection)


salaries= pd.read_sql('select * from salaries', connection)


titles= pd.read_sql('select * from title_id', connection)
titles = titles[1:]

dept_manager = pd.read_sql('select DISTINCT dept_no from dept_manager', connection)

departments = pd.read_sql('select * from departments', connection)



#test 

#employees
#salaries
titles
#dept_manager
#departments

  title_id               title
1    s0001               Staff
2    s0002        Senior Staff
3    e0001  Assistant Engineer
4    e0002            Engineer
5    e0003     Senior Engineer
6    e0004    Technique Leader
7    m0001             Manager

In [12]:
employee_salaries = employees.merge(salaries, on='emp_no')
employee_salaries

,emp_no,emp_title,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,1990-04-28,40000
1,475053,e0002,11/18/1954,Byong,Delgrande,F,1991-09-07,53422
2,57444,e0002,1/30/1958,Berry,Babb,F,1992-03-21,48973
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,1987-11-26,40000
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1991-01-18,40000
...,...,...,...,...,...,...,...,...
300019,464231,s0001,8/14/1958,Constantino,Eastman,M,1988-10-28,69696
300020,255832,e0002,5/8/1955,Yuping,Dayang,F,1995-02-26,75355
300021,76671,s0001,6/9/1959,Ortrud,Plessier,M,1988-02-24,61886
300022,264920,s0001,9/22/1959,Percy,Samarati,F,1994-09-08,62772
300023,464503,s0002,5/31/1964,Arvind,Slobodova,M,1987-11-23,41708

In [13]:
newTitles= employee_salaries.rename(columns= {'emp_title': 'title_id'})
newTitles

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,1990-04-28,40000
1,475053,e0002,11/18/1954,Byong,Delgrande,F,1991-09-07,53422
2,57444,e0002,1/30/1958,Berry,Babb,F,1992-03-21,48973
3,421786,s0001,9/28/1957,Xiong,Verhoeff,M,1987-11-26,40000
4,282238,e0003,10/28/1952,Abdelkader,Baumann,F,1991-01-18,40000
...,...,...,...,...,...,...,...,...
300019,464231,s0001,8/14/1958,Constantino,Eastman,M,1988-10-28,69696
300020,255832,e0002,5/8/1955,Yuping,Dayang,F,1995-02-26,75355
300021,76671,s0001,6/9/1959,Ortrud,Plessier,M,1988-02-24,61886
300022,264920,s0001,9/22/1959,Percy,Samarati,F,1994-09-08,62772
300023,464503,s0002,5/31/1964,Arvind,Slobodova,M,1987-11-23,41708

In [55]:
employee_salaries_df = titles.merge(newTitles, on='title_id')
#employee_salaries_df

employee_salaries_final = employee_salaries_df[['emp_no', 'title', 'salary']]
employee_salaries_final

        emp_no    title salary
0       473302    Staff  40000
1       421786    Staff  40000
2       273487    Staff  56087
3       246449    Staff  87084
4        48085    Staff  63016
...        ...      ...    ...
300019  111400  Manager  72446
300020  111133  Manager  71148
300021  110085  Manager  60026
300022  110386  Manager  40000
300023  111784  Manager  40000

[300024 rows x 3 columns]

In [54]:
#print(employee_salaries_final.dtypes)

employee_salaries_final = pd.DataFrame(employee_salaries_final)